       IDENTIFICATION DIVISION.
       PROGRAM-ID. MAIN.
       PROCEDURE DIVISION.
      * Some comment goes here. Classic hello world program.
           DISPLAY "HELLO WORLD IN COBOL".
           STOP  RUN.
